{
    "version": "https://jsonfeed.org/version/1",
    "title": "Github - behrev",
    "description": "",
    "home_page_url": "https://behrev.github.io",
    "feed_url": "https://behrev.github.io/feed.json",
    "user_comment": "",
    "author": {
        "name": "behrev"
    },
    "items": [
        {
            "id": "https://behrev.github.io/psa-verdopplungszeitrechner.html",
            "url": "https://behrev.github.io/psa-verdopplungszeitrechner.html",
            "title": "PSA Verdopplungszeitrechner",
            "summary": "Dokumentation Hier gehts zum Repo Die PSA-Verdopplungszeit (PSA-VZ) ist ein Maß dafür, wie schnell der PSA-Wert (Prostata-spezifisches Antigen) im Blut&hellip;",
            "content_html": "<h1>Dokumentation</h1>\n<p><a href=\"https://github.com/behrev/Verdopplungszeitrechner\" target=\"_blank\" rel=\"noopener noreferrer\">Hier gehts zum Repo</a></p>\n<div class=\"section\">\n<section>\n<h2>Was ist die PSA-Verdopplungszeit?</h2>\n<p>Die PSA-Verdopplungszeit (PSA-VZ) ist ein Maß dafür, wie schnell der PSA-Wert (Prostata-spezifisches Antigen) im Blut ansteigt. Sie wird in Monaten angegeben und ist ein wichtiger Faktor bei der Beurteilung des Risikos und des Verlaufs von Prostatakrebs, insbesondere nach einer Behandlung wie Operation oder Bestrahlung.</p>\n<p>Eine kurze PSA-VZ kann auf ein aggressiveres Wachstum des Krebses hindeuten, während eine lange PSA-VZ oft mit einem langsameren Wachstum verbunden ist.</p>\n</section>\n<section>\n<h2>Wie funktioniert der Rechner?</h2>\n<p>Dieser Rechner verwendet mindestens zwei PSA-Messwerte, um die Zeit zu schätzen, die benötigt wird, bis sich der PSA-Wert verdoppelt. Er berechnet die Wachstumsrate und daraus die Verdopplungszeit.</p>\n<p>Zusätzlich wird ein gleitender Durchschnitt der Verdopplungszeit berechnet und im Diagramm angezeigt, um Trends besser zu erkennen. Je mehr Messwerte Sie eingeben, desto genauer wird die Berechnung.</p>\n</section>\n<section>\n<h2>Bedienungsanleitung</h2>\n<ol>\n<li><strong>Patientendaten eingeben:</strong>\n<ul>\n<li>Geben Sie im Bereich \"Patientendaten\" den Vornamen, Nachnamen, das Geburtsdatum und gegebenenfalls das Datum der Operation (OP-Datum) des Patienten ein. Diese Informationen dienen zur Identifizierung und Dokumentation.</li>\n</ul>\n</li>\n<li><strong>PSA-Messwerte eingeben:</strong>\n<ul>\n<li><strong>Erste Messung:</strong> Geben Sie im Bereich \"Erste Messung\" das Datum der ersten PSA-Messung und den zugehörigen PSA-Wert ein. Sie können optional eine Notiz hinzufügen, um besondere Umstände oder Beobachtungen festzuhalten.</li>\n<li><strong>Zweite Messung:</strong> Geben Sie im Bereich \"Zweite Messung\" das Datum der zweiten PSA-Messung und den zugehörigen PSA-Wert ein. Auch hier können Sie eine Notiz hinzufügen.</li>\n<li><strong>Weitere Messungen:</strong> Für eine genauere Analyse empfiehlt es sich, weitere Messwerte in die Tabelle einzutragen (siehe Abschnitt \"Tabelle bearbeiten\").</li>\n</ul>\n</li>\n<li><strong>Berechnung starten:</strong>\n<ul>\n<li>Klicken Sie auf den \"Berechnen\"-Button, um die PSA-Verdopplungszeit basierend auf den eingegebenen Werten zu berechnen.</li>\n</ul>\n</li>\n<li><strong>Ergebnisse anzeigen:</strong>\n<ul>\n<li><strong>Verdopplungszeit:</strong> Die berechnete PSA-Verdopplungszeit in Monaten wird unterhalb des \"Berechnen\"-Buttons angezeigt.</li>\n<li><strong>Tabelle:</strong> Eine Tabelle zeigt alle eingegebenen Messwerte (Datum, PSA-Wert, Notiz) sowie die berechnete Verdopplungszeit zwischen den Messungen.</li>\n<li><strong>Diagramm:</strong> Ein Liniendiagramm visualisiert die PSA-Werte im Zeitverlauf. Zusätzlich wird ein gleitender Durchschnitt der Verdopplungszeit angezeigt, um Trends zu erkennen.</li>\n</ul>\n</li>\n</ol>\n</section>\n<section>\n<h2>Funktionen im Detail</h2>\n<ul>\n<li><strong>PSA-Verdopplungszeit berechnen:</strong>\n<ul>\n<li>Berechnet die Zeit, in der sich der PSA-Wert ausgehend von zwei Messpunkten verdoppelt.</li>\n</ul>\n</li>\n<li><strong>Daten speichern:</strong>\n<ul>\n<li>Speichert die eingegebenen Patientendaten und Messwerte im JSON-Format, um sie später wieder laden zu können.</li>\n</ul>\n</li>\n<li><strong>Daten laden:</strong>\n<ul>\n<li>Lädt zuvor gespeicherte Patientendaten und Messwerte aus einer JSON-Datei. Beim Aufruf des Programms, wird eine defailt.json im gleichen Serververzeichnis automatisch geladen. Diese Daten können gelöscht werden, um eigene Daten einzugeben und zu speichern.</li>\n</ul>\n</li>\n<li><strong>Diagramm:</strong>\n<ul>\n<li>Zeigt die PSA-Werte und den gleitenden Durchschnitt der Verdopplungszeit als Liniendiagramm an, um den Verlauf visuell darzustellen.</li>\n</ul>\n</li>\n<li><strong>Gleitender Durchschnitt:</strong>\n<ul>\n<li>Berechnet und visualisiert den gleitenden Durchschnitt der Verdopplungszeit über einen Zeitraum von 3 Messwerten. Dies hilft, langfristige Trends besser zu erkennen und kurzfristige Schwankungen auszugleichen.</li>\n</ul>\n</li>\n<li><strong>Tabelle bearbeiten:</strong>\n<ul>\n<li><strong>Messwerte hinzufügen:</strong> Um weitere Messwerte hinzuzufügen, füllen Sie die Felder \"Erste Messung\" und \"Zweite Messung\" aus und klicken Sie auf \"Berechnen\". Die neuen Werte werden automatisch zur Tabelle hinzugefügt.</li>\n<li><strong>Messwerte bearbeiten:</strong> Sie können die Werte in der Tabelle direkt bearbeiten, indem Sie auf die entsprechenden Felder klicken und die neuen Werte eingeben. Die Verdopplungszeit und das Diagramm werden automatisch aktualisiert.</li>\n<li><strong>Messwerte löschen:</strong> Jeder Eintrag in der Tabelle hat einen \"×\"-Button. Klicken Sie darauf, um den entsprechenden Messwert zu löschen. Die Verdopplungszeit und das Diagramm werden automatisch aktualisiert.</li>\n</ul>\n</li>\n<li><strong>Dark Mode:</strong>\n<ul>\n<li><strong>Umschalten:</strong> Aktivieren Sie den Schalter in der Navigationsleiste oben rechts, um zwischen dem hellen und dem dunklen Design zu wechseln. Der Dark Mode verbessert die Lesbarkeit bei schlechten Lichtverhältnissen und reduziert die Belastung für die Augen.</li>\n<li><strong>Farbanpassung:</strong> Über das Auswahlfeld neben dem Laden Button, kann ein Farbschema eingestellt werden. Die Farben des Diagramms und der Benutzeroberfläche werden automatisch an das gewählte Design angepasst.</li>\n</ul>\n</li>\n</ul>\n</section>\n<section class=\"hinweis\">\n<h2>Wichtiger Hinweis</h2>\n<p class=\"msg msg--highlight \">Dieser Rechner dient nur zu Informationszwecken und ersetzt keine ärztliche Beratung. Die Ergebnisse sollten immer mit einem qualifizierten Arzt besprochen werden, um eine fundierte Entscheidung über die Behandlung zu treffen.</p>\n</section>\n</div>",
            "author": {
                "name": "behrev"
            },
            "tags": [
                   "html"
            ],
            "date_published": "2025-03-05T21:19:38+01:00",
            "date_modified": "2025-08-15T16:10:03+02:00"
        },
        {
            "id": "https://behrev.github.io/mathematikscripte.html",
            "url": "https://behrev.github.io/mathematikscripte.html",
            "title": "Mathematikscripte",
            "summary": "Mit der Datei index.html können mehrere kleine Mathescripte aufgerufen werden. hier gehts zum Repo",
            "content_html": "<p>Mit der Datei index.html können mehrere kleine Mathescripte aufgerufen werden.</p>\n<p> </p>\n<p><a href=\"https://github.com/behrev/mathematikscripte\" target=\"_blank\" rel=\"noopener noreferrer\">hier gehts zum Repo</a></p>",
            "image": "https://behrev.github.io/media/posts/3/qg.PNG",
            "author": {
                "name": "behrev"
            },
            "tags": [
                   "java",
                   "html"
            ],
            "date_published": "2025-01-04T12:12:59+01:00",
            "date_modified": "2025-07-22T15:46:08+02:00"
        },
        {
            "id": "https://behrev.github.io/behrevpsa-vz.html",
            "url": "https://behrev.github.io/behrevpsa-vz.html",
            "title": "PSA-VZ ",
            "summary": "Hier gehts zum Repo Hier sind mehrere Versionen zur Berechnung und Visualisierung von PSA-Werten und deren Verdopplungszeiten hinterlegt. Die Versionen&hellip;",
            "content_html": "<p><a href=\"https://github.com/behrev/PSA-VZ\" target=\"_blank\" rel=\"noopener noreferrer\">Hier gehts zum Repo</a></p>\n<h1>Dokumentation</h1>\n<div class=\"section\">\n<h2>Überblick</h2>\n<p>Hier sind mehrere Versionen zur Berechnung und Visualisierung von PSA-Werten und deren Verdopplungszeiten hinterlegt.</p>\n<p>Die Versionen sind aufsteigend als<br><br>index.html</p>\n</div>\n<div class=\"section\">index2.html</div>\n<div>index3.html<br>index4.html</div>\n<div>index5.html<br><br></div>\n<div>benannt.</div>\n<div> </div>\n<div>Die erste Version ist ein sehr einfacher Rechner, die letzte ist ein rechner mit visualisierung und der Möglichkeit, die Daten zu speichern und wieder zu Laden.</div>\n<div> </div>\n<p> </p>",
            "image": "https://behrev.github.io/media/posts/2/psavz5.PNG",
            "author": {
                "name": "behrev"
            },
            "tags": [
                   "java",
                   "html"
            ],
            "date_published": "2025-01-02T17:49:16+01:00",
            "date_modified": "2025-07-22T15:46:30+02:00"
        },
        {
            "id": "https://behrev.github.io/github_behrev.html",
            "url": "https://behrev.github.io/github_behrev.html",
            "title": "behrev/tiefenschaerfe ",
            "summary": "Hier gehts zum Repo. Bei diesem kleinen Projekt handest es sich um eine HTML-Seite mit festem Format, bei dem man&hellip;",
            "content_html": "<p><a href=\"https://github.com/behrev/tiefenschaerfe\" target=\"_blank\" rel=\"noopener noreferrer\">Hier gehts zum Repo.</a></p>\n<p> </p>\n<p>Bei diesem kleinen Projekt handest es sich um eine HTML-Seite mit festem Format, bei dem man die Schärfentiefe berechen kann.</p>\n<p> </p>\n<p> </p>\n<p> </p>",
            "image": "https://behrev.github.io/media/posts/1/st-2.PNG",
            "author": {
                "name": "behrev"
            },
            "tags": [
                   "java",
                   "html"
            ],
            "date_published": "2025-01-02T10:10:07+01:00",
            "date_modified": "2025-07-22T15:47:25+02:00"
        }
    ]
}
